#include <stdio.h>

int main() {
    float a = 0.617;        //กำหนดค่าตัวแปร a โดยใช้ float เพระาสามารถเก็บค่าตัวเเปรทศนิยมได้
    int b = 25;             //กำหนดค่าตัวแปร b โดยใช้ int เพราะสามารถเก็บค่าตัวเเปรเป็นจำนวนเต็ม
    float c = 19.000;       //กำหนดค่าตัวแปร c โดยใช้ float เพระาสามารถเก็บค่าตัวเเปรทศนิยมได้
    int d = 9;              //กำหนดค่าตัวแปร d โดยใช้ int เพราะสามารถเก็บค่าตัวเเปรเป็นจำนวนเต็ม
    float e = 124.555;      //กำหนดค่าตัวแปร e โดยใช้ float เพระาสามารถเก็บค่าตัวเเปรทศนิยมได้
    float f = 0.001;        //กำหนดค่าตัวแปร f โดยใช้ float เพระาสามารถเก็บค่าตัวเเปรทศนิยมได้


    printf("a=%6.3f%%\n",a);                    //ช่องกว้าง 6 ทศนิยม 3 ตำแหน่ง ชิดขวา
      printf("b=  %4.d%%\n",b);                 //ช่องกว้าง 4 ชิดขวา 
       printf("c =%-8.3f%%\n",c);               //ช่องกว่าง 8 ทศนิยม 3 ตำแหน่ง ชิดซ้าย
          printf("d  =%-d %%\n",d);             //ช่องกว่าง 2  ชิดซ้าย
            printf("e=%-7.3f%%\n",e);           //ช่องกว่าง 7 ทศนิยม 3 ตำแหน่ง ชิดซ้าย
              printf("f=%-5.3f%%\n",f);         //ช่องกว่าง 5 ทศนิยม 3 ตำแหน่ง ชิดซ้าย
              return 0 ;
}